{
    "rules": [
      
      {
        "title": "Intro",
        "blocks": [
            { "type": "p",  "text": "Fastiloose! is the underlying ruleset for a 2 player, grid-based skirmish game built for small teams of fighters. It’s designed to avoid the lumbering pace of traditional, army-scale wargames and instead lean towards compact, tactical battles where every character matters." },
            { "type": "p",  "text": "Games are quick to set up and fast to play. Think of a sharp, decisive skirmish during a lunch break rather than a half-day campaign. The rules are portable and piece-agnostic. You don’t need a full, physical army or boxed set to begin." },
            { "type": "p",  "text": "At its core, all you need are these rules, a few sheets of paper, character tokens and a single six-sided die (d6). On top of this framework, optional Expansions and Modifier Decks can be added. These introduce options like the Fate Deck, Extension Classes, Terrain or Game Modes that shift the flow of play, allowing you to scale the depth and variety of each game." }
        ]
      },
      {
        "title": "Barebone Mechanics",
        "blocks": [
            { "type": "p",  "text": "This is the barebones game, without any add ons. No Fate Deck, No Modifiers or Extensions." },
            { "type": "h3",  "text": "Setup" },
            { "type": "ul", "items": ["Battlefield: 8x8 grid(Chessboard)", "Teams: 3 fighters per side (choose from Base Classes)", "No Terrain, No Fate Deck"] },
            { "type" : "h3", "text" : "Definition of a Full Round"},
            { "type": "ul", "items": ["Leading Movement Phase", "Following Movement Phase", "Leading Combat Phase", "Following Combat Phase", "End of Round"] },
            { "type" : "h3", "text" : "Round Order Decision"},
            { "type": "ul", "items": ["Decide round order(Leading and Following) via coin flip or d6 roll: 1-3 vs 4-6."] },
            { "type" : "h3", "text" : "Movement Phase"},
            { "type": "ul", "items": ["Each fighter may move up to MOV squares (orthogonal only; no diagonals)"] },
            { "type" : "h3", "text" : "Fate Phase"},
            { "type": "ul", "items": ["Each player draws a single card from the Fate Deck which each apply various effects to the Battlefield and Fighters.",
            "This phase can be removed if needed. This creates much faster, more predictable gameplay."] },
            { "type" : "h3", "text" : "Combat Phase"},
            { "type": "ul", "items": ["Each fighter may check if any enemies targets fall within their RANGE (orthogonal only; no diagonals)", "If the target is within RANGE, the attacker rolls D6 + HIT", "The target rolls D6 + DEF", "If the attacker’s total is higher, the attack succeeds → deal DAMAGE to the target’s HEALTH", "If the attacker’s total is lower, the attack fails → no effect", "Ties favour the attacker"] },
            { "type" : "h3", "text" : "Death"},
            { "type" : "ul", "items" : ["At HEALTH 0, remove the fighter"]},
            { "type" : "h3", "text" : "Win Conditions"},
            { "type" : "ul", "items" : ["Eliminate all enemy fighters"]},
            { "type": "p",  "text": "That's it." },
            { "type": "p",  "text": "This is Fastiloose! in its purest form. A pocket-sized skirmish game built for immediacy and replay. Everything else is a fancy bolt-on, easily stripped back to these simple roots." }
        ]
      },
      {
        "title" : "Hacking",
        "blocks" : [
            { "type": "p",  "text": "Fastiloose! is open for hacking." },
            { "type": "p",  "text": "Use the rules however you like, just don’t call it Fastiloose! unless you’ve kept the core intact." }
        ]
      },
      {
        "title" : "Gameplay Details",
        "blocks" : [
            { "type" : "h3", "text" : "Battlefield Basics"},
            { "type": "p",  "text": "Fastiloose! is a 2 player game played on a square-based grid." },
            { "type" : "ul", "items" : ["8x8(chessboard) is the standard-reference,  but any drawn grid will work.", "For quick, balanced games, a square battlefield is simplest, but you can experiment with custom-shaped maps for variant play."]},
            { "type" : "img", "src" : "./src/assets/images/8x8.png"},
            { "type" : "img", "src" : "./src/assets/images/8x8.png"},
            { "type" : "h3", "text" : "Team Size and Shape"},
            { "type" : "ul", "items" : ["Each player builds a team from the Base Classes (8 total)", 
              "The default team size is 3 fighters, which on an 8×8 grid produces a fast, ~30-minute skirmish",
              "Teams can be expanded freely for larger battles",
              "You can field duplicates of the same base classes"]},
              { "type" : "img", "src" : "./src/assets/images/ExampleTeam.png"},
              { "type" : "h3", "text" : "Fighter Stats"},
              { "type": "p",  "text": "Every fighter has a card with its stats." },
              { "type" : "img", "src" : "./src/assets/images/ExampleClass.png"},
              { "type" : "ul", "items" : ["HEALTH: Starting health amount",
                "MOV: Maximum movement distance per Movement Phase",
                "HIT: Attack accuracy; added to a 1d6 roll during Combat Phase",
                "DEF: Defense rating; added to a 1d6 roll when defending",
                "DAMAGE: Amount of HEALTH lost by the target on a successful hit",
                "RANGE: Maximum attack distance in one Combat Phase",
                "AREA: Shape of the attack."]},
              { "type": "p",  "text": "Types of AREA" },
              { "type" : "ul", "items" : ["SINGLE - Hits one square",
                "SPLASH - Hits one square plus the four orthogonal adjacent squares (N, E, S, W)",
                "MIXED - The fighter may choose between SINGLE or SPLASH per attack"]}
        ]
      },
      {
        "title" : "Core Gameplay Loop",
        "blocks" : [
            { "type" : "h3", "text" : "At a Glance"},
            { "type" : "ul", "items" : ["Decide Leading Player and Following Player",
                "Leading Player Movement Phase",
                "Following Movement Phase",
                "Fate Deck Draw (If Included)",
                "Apply Fate Deck Effects (If Included)",
                "Leading Player Combat Phase",
                "Following Player Combat Phase",
                "Repeat"]},
            { "type" : "h3", "text" : "In more Detail"},
            { "type" : "h3", "text" : "Deciding Leading Player vs Following"},
            { "type": "p",  "text": "The game starts with a 1d6 roll (1-3 vs 4-6), coin flip or similar 50/50 result to decide which player is the first and second to act." },
            { "type": "p",  "text": "In every phase and contest, the Leading Player will act first, followed by the Following Player. Some Fate cards may alter this order, in which case the roles are reversed and remain that way until stated." },
            
            { "type" : "h3", "text" : "Movement Phase"},
            { "type": "p",  "text": "During the Movement Phase, the Leading Player acts first, followed by the Following Player." },
            { "type": "p",  "text": "A Fighter may move within a number of squares up to its MOV (shown on its Base Class card). Measure MOV using orthogonal squares only (Manhattan distance)." },
            { "type": "p",  "text": "Once all fighters on the Leading Player’s team are moved, the Following player moves their own fighters." },
            { "type" : "h4", "text" : "Example — Light Duelist"},
            { "type": "pi",  "text": "MOV 4: May move up to 4 squares this phase; each step must be to an adjacent orthogonal square." },
            { "type" : "h4", "text" : "Diagonal Movement"},
            { "type": "pi",  "text": "Diagonal Movement is NOT allowed using the Core Rules. Manhattan style(orthogonal) is used to measure MOV distance." },
            
            { "type" : "h3", "text" : "Fate Deck Phase"},
            { "type": "p",  "text": "During the Fate Deck Phase, the Leading Player acts first, followed by the Following Player." },
            { "type": "p",  "text": "Each player will draw one card from the Fate Deck. All results of this card will be played out before proceeding with the next phase." },
            { "type": "p",  "text": "After all effects are resolved, return all cards to the Fate Deck and reshuffle it." },
            { "type" : "h4", "text" : "Example 1 - The Leading Player draws the card: A Strong Gust"},
            { "type": "ul",  "items": ["Card Text: Choose 1 straight line across the board(edge to edge). All fighters on that line MUST move by 1 square in a single direction of this card drawer’s choice. If that fighter is blocked by teammates, terrain or the battlefield’s edge, that fighter does NOT move.",
              "All fighters on that line are moved 1 square.",
              "Proceed to Following Player’s card draw."
            ] },
            { "type" : "h4", "text" : "Example 2 - The Following Player draws the card: A Mild Drizzle"},
            { "type": "ul",  "items": ["Card Text: A few raindrops fall, but nothing happens.)",
              "No effect applied. Proceed to Combat Phase."
            ]},

            { "type" : "h3", "text" : "Combat Phase"},
            { "type": "p",  "text": "During the Combat Phase, the Leading Player acts first, followed by the Following Player." },
            { "type" : "h3", "text" : "Targeting"},
            { "type": "p",  "text": "A Fighter may attack a target within a number of squares up to its RANGE (shown on its Base Class card). Measure RANGE using orthogonal squares only (Manhattan distance)." },
            { "type" : "h4", "text" : "Example - Light Duelist"},
            { "type": "p",  "text": "RANGE 1: May attack one enemy Fighter in an adjacent orthogonal square." },

            { "type" : "h3", "text" : "Attack"},
            { "type": "p",  "text": "Each Fighter has a HIT stat. This is their base Attack value." },
            { "type": "p",  "text": "The attacking player rolls a single d6. The result of this roll is combined with the attacking Fighter’s HIT stat to produce the Total Attack value." },
            { "type" : "h4", "text" : "Example — Light Duelist"},
            { "type": "pi",  "text": "HIT 2 + d6 roll of 3: Total Attack value of 5." },

            { "type" : "h3", "text" : "Defence"},
            { "type": "p",  "text": "Each Fighter has a DEF stat. This is their base Defence value." },
            { "type": "p",  "text": "The attacking player rolls a single d6. The result of this roll is combined with the attacking Fighter’s HIT stat to produce the total Attack value." },
            { "type" : "h4", "text" : "Example — Light Duelist"},
            { "type": "pi",  "text": "HIT 2 + d6 roll of 3: Total Attack value of 5." },



            { "type" : "h3", "text" : "Critical Attacks (Auto-Hit)"},
            { "type": "p",  "text": "After the attacker rolls, if the Attack total (HIT + d6 + modifiers) is greater than the defender’s maximum possible Defense for this contest (DEF + 6 + modifiers), the attack is a Critical Attack. Do not roll Defense; it automatically hits." },
            { "type": "p",  "text": "Only Fate Deck card effects that change HIT or DEF before comparison can prevent a Critical Hit." },
            { "type": "p",  "text": "A Critical Attack adds no extra effects." },
            { "type" : "h4", "text" : "Example 1 - Heavy Duelist(Attacking)"},
            { "type": "pi",  "text": "HIT 4 + d6 roll of 6: Total Attack value of 10." },
            { "type" : "h4", "text" : "Example 2 - Heavy Marksman(Defending)"},
            { "type": "pi",  "text": "DEF 2 + d6 roll of 6: Total Defence value of 8." },
            { "type": "pi",  "text": "10 > 8: Critical Attack (auto-hit)." }


            
        ]
      },
      {
        "title" : "Glossary",
        "blocks" : [
            { "type" : "h3", "text" : "Term Definitions"},
            { "type": "p",  "text": "1 Full Round:" },
            { "type" : "ul", "items" : [
                "Leading Player Movement Phase",
                "Following Movement Phase",
                "Fate Deck Draw (draw, apply, return/shuffle)",
                "Leading Player Combat Phase",
                "Following Player Combat Phase",
                "End of Round (clear temporary effects)"]},

            { "type": "p",  "text": "Adjacent" },
            { "type": "p",  "text": "Orthogonal neighbor only (no diagonals)" },
            { "type": "p",  "text": "Line of Sight (LoS)" },
            { "type": "p",  "text": "A straight line between starting and target squares (orthogonal or diagonal is allowed) with no High Terrain between attacker and target. Fighters do not block LoS." },
            { "type": "p",  "text": "Shift" },
            { "type": "p",  "text": "Forced movement of exactly n squares in a direction (N, S, E, W). If the destination is off-board or occupied, do not move." },
            { "type": "p",  "text": "Global Direction" },
            { "type": "p",  "text": "One direction(N, S, E, W) applied to all specified fighters." },
            { "type": "p",  "text": "Fixed HIT (x)" },
            { "type": "p",  "text": "Attacker’s total value for the attack is x, without modification." }
            
        ]
      }

    ]
  }










